Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.RebarGroup)
Selects the current applied attributes to the given Tekla.Structures.Model.RebarGroup instance.
Throws System.ArgumentNullException: Thrown when rebarGroup is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for rebarGroup.
rebarGroup: The Tekla.Structures.Model.RebarGroup to set the current applied values to.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.ControlArc)
Selects the current applied attributes to the given Tekla.Structures.Model.ControlArc instance.
Throws System.ArgumentNullException: Thrown when controlArc is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for controlArc.
controlArc: The Tekla.Structures.Model.ControlArc to set the current applied values to.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.ControlCircle)
Selects the current applied attributes to the given Tekla.Structures.Model.ControlCircle instance.
Throws System.ArgumentNullException: Thrown when controlCircle is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for controlCircle.
controlCircle: The Tekla.Structures.Model.ControlCircle to set the current applied values to.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.ControlLine)
Selects the current applied attributes to the given Tekla.Structures.Model.ControlLine instance.
Throws System.ArgumentNullException: Thrown when controlLine is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for controlLine.
controlLine: The Tekla.Structures.Model.ControlLine to set the current applied values to.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.ControlPolycurve)
Selects the current applied attributes to the given Tekla.Structures.Model.ControlPolycurve instance.
Throws System.ArgumentNullException: Thrown when controlPolycurve is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for controlPolycurve.
controlPolycurve: The Tekla.Structures.Model.ControlPolycurve to set the current applied values to.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes``1(``0)
Selects the current applied attributes to the given Tekla.Structures.Model.GridBase instance.
Throws System.ArgumentNullException: Thrown when grid is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for grid.
grid: The Tekla.Structures.Model.GridBase to set the current applied values to.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.LoftedPlate,Tekla.Structures.Dialog.Data.MaterialType)
Selects the current applied attributes to the given Tekla.Structures.Model.LoftedPlate instance.
Throws System.ArgumentNullException: Thrown when loftedPlate is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for loftedPlate.
loftedPlate: The Tekla.Structures.Model.Part to set the current applied values to.
materialType: The type of material of loftedPlate.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectPartAppliedAttributes(Tekla.Structures.ModelInternal.dotPart_t@,Tekla.Structures.Dialog.Data.Native.dotMaterialType)
Selects the current applied values to part.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type and Tekla.Structures.ModelInternal.dotPart_t.SubType.
part: The Tekla.Structures.ModelInternal.dotPart_t instance to set the current applied values to.
dotMaterialType: The type of material of the part to select the applied values for.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectColumnAppliedLevels(Tekla.Structures.Model.Beam.BeamTypeEnum,Tekla.Structures.Dialog.Data.Native.dotMaterialType,System.Double@,System.Double@)
Selects the current default bottom and top levels for a Tekla.Structures.Model.Beam with the given Tekla.Structures.Model.Beam.BeamTypeEnum.
beamType: The type of beam to get the current applied levels for.
dotMaterialType: The type of material of the beam to get the current applied levels for.
bottomLevel: The offset to apply on Tekla.Structures.Model.Beam.StartPoint against a specific reference location.
topLevel: The offset to apply on Tekla.Structures.Model.Beam.EndPoint against a specific reference location.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportCreateRebarMeshFromInputValues(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotPoint_t[],System.Int32,Tekla.Structures.ModelInternal.dotRebarMesh_t@)
Creates a Tekla.Structures.ModelInternal.dotRebarMesh_t from the given input values.
fatherIdentifier: The identifier of the father part.
inputPoints: The sequence of input points.
amountOfInputPoints: The count of input points.
dotRebarMesh: The constructed rebar mesh.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectSingleRebarApliedAttributes(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
Selects the current applied values to singleRebar.
singleRebar: The Tekla.Structures.ModelInternal.dotSingleRebar_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectRebarGroupAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
Selects the current applied values to rebarGroup.
rebarGroup: The Tekla.Structures.ModelInternal.dotRebarGroup_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectControlObjectAppliedAttributes(Tekla.Structures.ModelInternal.dotControlObject_t@)
Selects the current applied values to controlObject.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type and Tekla.Structures.ModelInternal.dotPart_t.SubType.
controlObject: The Tekla.Structures.ModelInternal.dotControlObject_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectGridAppliedAttributes(Tekla.Structures.ModelInternal.dotGrid_t@)
Selects the current applied values to grid.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type.
grid: The Tekla.Structures.ModelInternal.dotGrid_t instance to set the current applied values to.
Returns: Greater than zero on success; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectLoftedPlateAppliedAttributes(Tekla.Structures.ModelInternal.dotPart_t@,Tekla.Structures.Dialog.Data.Native.dotMaterialType,System.Int32@)
Selects the current applied values to part which is Tekla.Structures.Model.LoftedPlate.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type and Tekla.Structures.ModelInternal.dotPart_t.SubType.
part: The Tekla.Structures.ModelInternal.dotPart_t instance to set the current applied values to.
dotMaterialType: The type of material of the part to select the applied values for.
faceType: Lofted plate solid face type.
Returns: Greater than zero on success; otherwise, zero.